backend_top_trumps/app/models/game.rb

    def turn(card_one_id = nil, card_two_id = nil, attr = nil)
        card_one = Card.find_by(id: card_one_id)
        card_two = Card.find_by(id: card_two_id)
---
SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]