backend_top_trumps/app/controllers/games_controller.rb

    def create
        current_round = RoundState.last
# byebug
        if current_round && current_round.p1_id && !current_round.game_id && !current_round.p2_id
            user_two = User.find_or_create_by(name: params[:player_two_name])
            current_round.p2_id = user_two.id

            current_round.save
        else
            round = RoundState.new

            user_one = User.find_or_create_by(name: params[:player_one_name])
            round.p1_id = user_one.id
            round.save
        end

        if current_round && current_round.p1_id && current_round.p2_id && !current_round.game_id
            player_one = User.find_by(id: current_round.p1_id)
            player_two = User.find_by(id: current_round.p2_id)
            game = Game.create(player_one: player_one, player_two: player_two)
            current_round.game_id = game.id
            (rand < 0.5) ? current_round.turn = true : current_round.turn = false
            # byebug
            current_round.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "round_states" SET "p1_card_id" = $1, "p2_card_id" = $2, "p1_cards_amount" = $3, "p2_cards_amount" = $4, "updated_at" = $5 WHERE "round_states"."id" = $6  [["p1_card_id", 3], ["p2_card_id", 4], ["p1_cards_amount", "5"], ["p2_cards_amount", "5"], ["updated_at", "2019-02-14 09:39:09.909396"], ["id", 1]]
UPDATE "games" SET "winner_id" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["winner_id", 1], ["updated_at", "2019-02-13 13:58:02.808579"], ["id", 1]]