backend_top_trumps/app/controllers/games_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "mani"], ["created_at", "2019-02-14 13:50:40.259080"], ["updated_at", "2019-02-14 13:50:40.259080"]]
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "mani"], ["LIMIT", 1]]
INSERT INTO "games" ("player_one_id", "player_two_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["player_one_id", 5], ["player_two_id", 6], ["created_at", "2019-02-14 13:50:40.272852"], ["updated_at", "2019-02-14 13:50:40.272852"]]
---
    def create
        player_one = User.find_or_create_by(name: params[:name])
        player_two = User.find_or_create_by(name: params[:name])

        @game = Game.new(player_one_id: player_one, player_two_id: player_two)
            if @game.save

INSERT INTO "round_states" ("p1_id", "p2_id", "game_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["p1_id", 1], ["p2_id", 2], ["game_id", 1], ["created_at", "2019-02-14 12:13:07.795767"], ["updated_at", "2019-02-14 12:13:07.795767"]]
---
    def round
        find_game

        if @round.attr_name
            #find out whos the card winner
            # byebug
            loser_card = @game.turn(@round.p1_card_id, @round.p2_card_id, @round.attr_name)
            new_round = RoundState.new(game: @game, p1_id: @game.player_one_id, p2_id: @game.player_two_id )

            loser_card.id == @round.p1_card_id ? new_round.next_turn_player_id = @game.player_one_id : new_round.next_turn_player_id = @game.player_two_id

            if new_round.save

UPDATE "games" SET "winner_id" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["winner_id", 2], ["updated_at", "2019-02-14 11:43:04.008153"], ["id", 1]]
---
    def winner
        winner_pl = @game.winner(@round.p1_cards_amount, @round.p2_cards_amount)
        byebug

        if winner_pl.in? [true, false]
            case winner_pl
                when true
                    @game.update(winner_id: @player_one.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def find_player_one
        @player_one = User.find_by(id: @round.p1_id)

SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def find_game
        # byebug
        @game = Game.find_by(id: @round.game)

SELECT  "round_states".* FROM "round_states" WHERE "round_states"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def find_round
        # byebug
        @round = RoundState.find_by(id: params[:round_id])