backend_top_trumps/app/controllers/games_controller.rb

UPDATE "games" SET "winner_id" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["winner_id", 1], ["updated_at", "2019-02-13 13:58:02.808579"], ["id", 1]]
---
    def round_result
        # @game = Game.find_by(id: params[:game_id])
        winner_pl = @game.winner(params[:pl_one_cards], params[:pl_two_cards])
        byebug

        if winner_pl.is_a?(true.class)

            case winner_pl
            when true
                @game.update(winner_id: @player_one.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def find_player_one
        @player_one = User.find_by(id: params[:player_one_id])